package com.hw.hw_9;

public class MyStack {
   /* Написати свій клас MyStack як аналог класу Stack, який працює по принципу LIFO (last-in-first-out).

    Можна робити з допомогою Node або використати масив.

    Методи

    push(Object value) додає елемент в кінець
    remove(int index) видаляє елемент по індексу
    clear() очищає колекцію
    size() повертає розмір колекції
    peek() повертає перший елемент стеку
    pop() повертає перший елемент стеку та видаляє його з колекції*/
}
